source /home/md1/eda/synopsys/prime/R-2020.09-SP4/admin/setup/.synopsys_pt.setup
set starttime [clock seconds]
echo "INFORM: Start job at: " [clock format $starttime -gmt false]
set is_si_enabled false
set top_design pci_bridge32
set link_library "* ../Timing_Lib/scc14nsfp_90sdb_9tc16_rvt_ssg_v0p63_125c_ccs.db"
set netlist "../Icc2Output/${top_design}_route.v"
set sdc "../Icc2Output/${top_design}_route.sdc"
set spef "../Icc2Output/${top_design}.rcworst_125_1.08_1.08_1_1.spef"
source -e -v ../pt_variable.tcl
set NET_FILE $netlist 
set SDC_FILE $sdc
set SPEF_FILE $spef
set_app_var read_parasitics_load_locations true
set_app_var eco_allow_filler_cells_as_open_sites true
###################################################################
read_verilog  $NET_FILE
link
read_parasitics -keep_capacitive_coupling  -format SPEF  $SPEF_FILE
source -e -v $SDC_FILE
set_propagated_clock [all_clocks]
set timing_remove_clock_reconvergence_pessimism true
set timing_disable_clock_gating_checks true  
set timing_report_unconstrained_paths true
update_timing -full
# report_net -connections -verbose > ../PtRpt/${top_design}_net.rpt
# report_analysis_coverage -status_details violated -check_type setup -nosplit -significant_digits 8 > ../PtRpt/${top_design}_violated_endpoint.rpt
# report_analysis_coverage -status_details met -check_type setup -nosplit -significant_digits 8 > ../PtRpt/${top_design}_met_endpoint.rpt
# report_analysis_coverage -status_details untested -check_type setup -nosplit -significant_digits 8 > ../PtRpt/${top_design}_untested_endpoint.rpt
# write_sdf -significant_digits 8 -input_port_nets -output_port_nets ../PtRpt/${top_design}.sdf
# if {[file exists ../Delay_scripts/${top_design}_Delay.tcl]} {
#     source ../Delay_scripts/${top_design}_Delay.tcl > ../PtRpt/${top_design}_Delay.rpt
# }


